---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarBarType
source: html/467b44cc-54e7-3ecf-07e1-ad15d05fe800.htm
---
# Autodesk.Revit.DB.Structure.RebarBarType

A Rebar type object that is used in the generation of Rebar

## Syntax (C#)
```csharp
public class RebarBarType : ElementType
```